Pandas is a high-level data manipulation tool, built on the Numpy package and its key data structure is called the DataFrame. DataFrames allow you to store and manipulate tabular data in rows of observations and columns of variables.

- import data 
- read data 
- dispay data in DataFrame

In [5]:
#creation of a dictionary (one way to create a pandas DataFrame)

import pandas as pd
import numpy as np

In [14]:
#create dictionary of test scores 
#with keywords 
test_dict = {"Corey": [63,75,88], "Kevin": [48,98,92], "Akshay": [87,86,85]}

print(test_dict)

{'Corey': [63, 75, 88], 'Kevin': [48, 98, 92], 'Akshay': [87, 86, 85]}

In [13]:
#place the test_dict nto the DataFrame method

df = pd.DataFrame(test_dict)
print("show the data ")
print (df)

#to dispay without print! 
df

   Corey  Kevin  Akshay
0     63     48      87
1     75     98      86
2     88     92      85

   Corey  Kevin  Akshay
0     63     48      87
1     75     98      86
2     88     92      85

each row and column is represented as a series (one-dimenisonal array)

In [15]:
#transpose changes rows and columns 
df.transpose()

         0   1   2
Corey   63  75  88
Kevin   48  98  92
Akshay  87  86  85

In [19]:
#easier to transpose  (back again )

df =df.T

df

   Corey  Kevin  Akshay
0     63     48      87
1     75     98      86
2     88     92      85